module.exports = {
    welcome: 'ยินดีต้อนรับสู่ไดอะเกม!',
    lesson: 'หัวข้อบทเรียน',
    subLesson: 'เมนูอาหาร\nทำการคลิกเพื่อเล่น!',
    profile: 'ข้อมูลโปรไฟล์ของผู้เล่น',
    language: 'สวิซสำหรับเปลี่ยนภาษา',
    signout: 'ปุ่มออกจากระบบ',
    photo: 'รูปเมนูอาหาร',
    menuInfo: 'รายละเอียดของเมนูอาหาร',
    achievement: 'เมนูอาหารที่ทำสำเร็จ',
    //element
    element:{
        start: 'ผังการทำงานจะเริ่มจากจุดนี้เสมอ',
        end: 'และจะสิ้นสุดการทำงานที่จุดนี้เสมอ',
        tool: 'ปุ่มเปลี่ยนเครื่องมือ',
        play: 'ปุ่มเล่นเกม'
    }
};