module.exports = {
    variable: {
        juice: {
            material: ['น้ำส้ม 1 กล่อง'],
            step: [
                'เตรียมแก้วสำหรับใส่น้ำส้ม',
                'เทน้ำส้มใส่แก้วที่เตรียมไว้'
            ]
        },
        cereal: {
            material: [
                'ซีเรียล 1 กล่อง',
                'นมสด 300 มล'
            ],
            step: [
                'เตรียมชามใส่ซีเรียล',
                'เตรียมนมสด',
                'เตรียมซีเรียล',
                'เทซีเรียลและนมใส่ชาม'
            ]
        },
        salad: {
            material: [
                'ผักตามที่ชอบ',
                'น้ำสลัดที่ชอบ'
            ],
            step: [
                'เตรียมชามใส่สลัด',
                'เตรียมผัก',
                'เตรียมน้ำสลัด',
                'นำผักและน้ำสลัดใส่ชาม',
                'ผสมส่วนผสมให้เข้ากันให้เข้ากัน'
            ]
        }
    },
    io: {
        juice: {
            material: [
                'แอปเปิ้ลสด 1 ผล'
            ],
            step: [
                'ใส่แอปเปิ้ล',
                'ปั่นน้ำ',
                'ได้น้ำแอปเปิ้ล'
            ]
        },
        toast: {
            material: [
                'ขนมปังตามใจชอบ'
            ],
            step: [
                'เตรียมขนมปัง',
                'ใส่เครื่องปิ้ง',
                'เลือกระดับไฟ',
                'ตรวจสอบขนมปังว่าได้ตามที่ต้องการแล้วหรือไม่'
            ]
        },
        bacon: {
            material: [
                'เบคอนตามใจชอบ'
            ],
            step: [
                'เตรียมกระทะและใส่เบคอน',
                'เลือกระดับไฟ',
                'เลือกเวลา',
                'ได้รับเบคอน'
            ]
        }
    },
    decision: {
        coffee: {
            material: [
                'กาแฟ 2 ช็อต',
                'นมสด 3 ออนซ์'
            ],
            step: [
                'ชงหัวเชื้อกาแฟ', 
                'เติมนมเพื่อชงลาเต้หรือไม่เติมนมเพื่อชงเอสเปรสโซ่',
            ]
        },
        steak: {
            material: [
                'เนื้อวัว 1 ชิ้น'
            ],
            step: [
                'เตรียมเนื้อวัว',
                'เตรียมกระทะ',
                'เลือกระดับไฟ',
                'ได้รับสเต็ก'
            ]
        },
        pasta: {
            material: [
                'เตรียมเส้นพาสต้าตามใจชอบ.',
                'เตรียมซอสพาสต้าตามใจชอบ'
            ],
            step: [
                'เลือกประเภทของเส้น',
                'เตรียมหม้อ',
                'ต้มเส้นพาสต้า',
                'เลือกซอสพาสต้า',
                'ได้รับพาสต้า',
            ]
        },
        decision_3: {
            material: [],
            step: []
        }
    },
    loop: {
        smoothie: {
            material: [],
            step: []
        },
        dough: {
            material: [],
            step: []
        },
        whipedCream: {
            material: [],
            step: []
        },
        eclair: {
            material: [],
            step: []
        }
    }
};